# ZoneEquipmentId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SystemZoneData..::..ZoneEquipmentId Property
SystemZoneData Class See Also
---
The id of the zone equipment related to the zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public ElementId ZoneEquipmentId { get; set; }
```

Visual Basic
---
```text
Public Property ZoneEquipmentId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ZoneEquipmentId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace